# server/models/user.py
# הקובץ הזה מגדיר מודל נתונים פשוט שמייצג משתמש במערכת.
# המודל נבנה בעזרת ספריית
# Pydantic
# ומאפשר לבדוק בצורה אוטומטית שהשדות שהוזנו תקינים.
from pydantic import BaseModel

# מחלקה שמייצגת משתמש –
# User
# יורשת מ־
# BaseModel
# של
# Pydantic
# מה שאומר שכל פעם שיוצרים מופע של המחלקה,
# הספרייה תוודא שהערכים שהוזנו תואמים לסוג הנתונים שהוגדר.
class User(BaseModel):
    # שם המשתמש
    # מחרוזת חובה
    username: str

    # סיסמת המשתמש
    # מחרוזת חובה
    password: str
